opends/tests/functional-tests/shared/data/dsml/suites/02oasissuite/data/search.dat

POST / HTTP/1.1
Host: Foo
Pragma: no-cache
Connection: Close
Content-Length: 586
SOAPAction: "#batchRequest"

<?xml version='1.0' encoding='UTF-8'?>
  <soap-env:Envelope
      xmlns:xsd='http://www.w3.org/2001/XMLSchema'
      xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
      xmlns:soap-env='http://schemas.xmlsoap.org/soap/envelope/'>
    <soap-env:Body>
      <batchRequest xmlns="urn:oasis:names:tc:DSML:2:0:core">
        <searchRequest dn="dc=example, dc=com" scope="wholeSubtree" derefAliases="neverDerefAliases">
        <filter>
        <present name="objectclass" />
        </filter>
        </searchRequest>
      </batchRequest>
    </soap-env:Body>
  </soap-env:Envelope>
